// Три основні варіанти звернення до html:

// Перший варіант(через селектор тегу):     
$('a');
// Другий варіант(через селектор id):           
$('#h2');
// Третій варіант(через селектор class):       
$('.h2');
// =====================================

// Вибірка по атрибуту:
// Щоб звернутись до всіх тегів div в якомусь блоці можна використати такий запис:
$('.block div');
// Щоб звернутись конкретно до дочірніх div (а не всіх div які є в .block), використовується знак ’>’, між селектором класа та div:
$('.block > div');
// Щоб використати сусідній елемент потрібно використати знак «+»:
$('.block + div'); //вибереться тільки перший div в класі .block, якщо будуть ще div після div вони не будуться змінюватись.
// Селектор атрибуту(типу src, img…). Щоб звернутись наприклад до селектору атрибуту певного елементу потрібно:
$('img[height=150]'); //Якщо в елемента на сторінці є атрибут height=’150’.
// Якщо потрібно звернутись наприклад до всіх img в яких scr починається з img/ потрібно:
$('img[src^=img/]'); // Зміни будуть застосовуватись до всіх елементів img в яких src починається з img/.
// Щоб застосувати зміни до вибраних елементів по їх закінченню, наприклад по формату зображення:
$('img[src$=.png]');
// Щоб застосувати зміни до елемента в якого в будь-якому місці є , наприклад, #:
$('a[href*=#]');
// =====================================

//Фільтрація виборок:
// 1. Щоб вибрати парні елементи, наприклад li в menu потрібно:
$('menu li:odd');
// 2. Щоб вибрати непарні елементи, наприклад li в menu потрібно:
$('menu li:even');//в css буде навпаки тому що jQuery - це програмування і елементи починаються з 0;
// 3. Щоб вибрати всі елементи крім якогось:
$('img:not(.logo img)'); //виберуться всі елементи img крім img яке в класі logo;
// 4. Щоб вибрати, всі елементи наприклад li, в яких є атрибут a потрібно:
$('li:has(a)'); // в css такого аналога немає;
// 5. Щоб вибрати, всі елементи наприклад p, в яких є певний текст , наприклад «client» потрібно:
$(’p:contains(client)’); 
// 6. Щоб вибрати перший елемент, наприклад li, потрібно:
$(’li:first’); 
// 7. Щоб вибрати перший елемент, наприклад li, потрібно:
$(’li:last’); 
// 8. Щоб вибрати всі елементи, які наприклад hidden, потрібно:
$(’div:hidden’); 
// 9. Щоб вибрати всі елементи, які наприклад visibility, потрібно:
$(’div:visibility’);
// =====================================

